# IFC_GetIFCScheme

## Description
Gets the active IFC version

```pascal
FUNCTION IFC_GetIFCScheme(VAR outScheme : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_GetIFCScheme():
    return (BOOLEAN, outScheme)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|outScheme|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* IFC